tutorials/cfdemSolverRhoPimpleChem/SingleParticleCases/GOD0k1_Hematite/CFD/constant/foam.inp
species
(
    CO
    CO2
    N2
);

reactions
{
}


