tutorials/cfdemSolverRhoPimpleChem/SingleParticleCases/GOD0k1_Hematite/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu      nu [ 0 2 -1 0 0 0 0 ] 1.526e-05;        // dnyamic viscosity of CO : 1.74*10^-5 [kg/ms] -- density: 1.14 kg/m3
                                                // dynamic viscosity of O2 = 2,04-10^-5[kg/ms];
                                                // density of O2 = 1.4290 [kg/m^3]
                                                // kinematic viscosity of air (o2+n2) = 1.48e-05;

kf      kf [ 1 1 -3 -1 0 0 0 ] 0.0507;          // comes from energy model

Cp      Cp [ 0 2 -2 -1 0 0 0 ] 1118.15;         // comes from energy model


// ******* Non-Newtonian transport properties ************************ //
/*CrossPowerLawCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    m               m [ 0 0 1 0 0 0 0 ] 1;
    n               n [ 0 0 0 0 0 0 0 ] 1;
}

BirdCarreauCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    k               k [ 0 0 1 0 0 0 0 ] 0;
    n               n [ 0 0 0 0 0 0 0 ] 1;
}
*/
// ************************************************************************* //
